'''
应纳税所得额 = 工资收入金额 － 各项社会保险费 － 起征点(3500元)
应纳税额 = 应纳税所得额 x 税率 － 速算扣除数

个人所得税计算方法
缴税=全月应纳税所得额*税率－速算扣除数
全月应纳税所得额=(应发工资－四金)－3500
实发工资=应发工资－四金－缴税

个人所得税的缴纳标准 ：
1)从收人3500元开始征收 ,低于3500元的不用缴纳个人所得税 。
2)税额不超过1500元的部分,接照3％的税率缴纳。
3）税额超过1500元到4500元的部分，按照10％的税率缴纳,速算扣除数为105。
4）税额超过4500元到9000元的部分 ,按照20％的税率缴纳，速算扣除数为555。
5）税额超过9000元到35000元的部分,按照25％的税率缴纳，速算扣除数为1005。
6）税额超过35000元到50000元的部分,按照30％的税率缴纳，速算扣除数为2755。
7）税额超过55000元到80000元的部分,按照35％的税率缴纳，速算扣除数为5505。
8）税额超过80000元的部分,按照45％的税率缴纳，速算扣除数为13505。
'''
# 输入工资
salary = int(input('请输入您的工资：'))
#应纳税所得额
tax = salary - 3500;
#计算实际工资
if salary <= 0:
    print('输入错误！！')
elif salary <= 3500:
    tax = salary - 3500;
    print('你无需缴纳个人所得税!')
elif tax <= 1500:
    tax = salary - 3500;
    print('您所缴的个人所得税为:%d' % (tax*0.03))
    print('您的税后工资为:%0.2f' % (salary-tax*0.03))
elif (tax > 1500 and tax < 4500):
    tax = salary - 3500;
    print('您所缴的个人所得税为:%d' % (tax * 0.1-105))
    print('您的税后工资为:%0.2f' % (salary - (tax * 0.1-105)))
elif (tax >= 4500 and tax < 9000):
    tax = salary - 3500;
    print('您所缴的个人所得税为:%d' % (tax * 0.2 - 555))
    print('您的税后工资为:%0.2f' % (salary - (tax * 0.2 - 555)))
elif (tax>=9000 and tax<35000):
    tax = salary - 3500;
    print('您所缴的个人所得税为:%d' % (tax * 0.25 - 1050))
    print('您的税后工资为:%0.2f' % (salary - (tax * 0.25 - 1050)))
elif (tax>=35000 and tax <55000):
    tax = salary - 3500;
    print('您所缴的个人所得税为:%d' % (tax * 0.3 - 2755))
    print('您的税后工资为:%0.2f' % (salary - (tax * 0.3 - 2755)))
elif (tax >=55000 and tax < 80000):
    tax = salary - 3500;
    print('您所缴的个人所得税为:%d' % (tax * 0.35 - 5505))
    print('您的税后工资为:%0.2f' % (salary - (tax * 0.35 - 5505)))
else:
    tax = salary - 3500;
    print('您所缴的个人所得税为:%d' %  (tax * 0.45 - 13505))
    print('您的税后工资为:%0.2f' % (salary - (tax * 0.3 - 13505)))