menu = {
    '北京': {
        '海淀': {
            '五道口': {
                'soho': {},
                '网易': {},
                'google': {}
            },
            '中关村': {
                '爱奇艺': {},
                '汽车之家': {},
                'youku': {},
            },
            '上地': {
                '百度': {},
            },
        },
        '昌平': {
            '沙河': {
                '老男孩': {},
                '北航': {},
            },
            '天通苑': {},
            '回龙观': {},
        },
        '朝阳': {},
        '东城': {},
    },
    '上海': {
        '闵行': {
            "人民广场": {
                '炸鸡店': {}
            }
        },
        '闸北': {
            '火车战': {
                '携程': {}
            }
        },
        '浦东': {},
    },
    '山东': {},
}

print(type(menu))

print('打印第一级目录:',menu['北京'])
print('打印第二级目录:',menu['北京']['海淀'])
print('打印第三级目录:',menu['北京']['海淀']['五道口'])
print('打印第四级目录:',menu['北京']['海淀']['五道口']['soho'])

# Flag = True
# while Flag:
#         chioce1  = input('请输入>>>')
#         if chioce1 in menu:
#             print(chioce1)
#
#
#

print(bin(10))
